Tekla Open API Reference for Tekla Structures 2025
ModelViewEnumerator Class
 The ModelViewEnumerator class is an enumerator class for model views. The enumerator enables model view items to be looped.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.UI.ModelViewEnumerator
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ModelViewEnumerator : IEnumerator
<SerializableAttribute>
Public NotInheritable Class ModelViewEnumerator
	Implements IEnumerator
The ModelViewEnumerator type exposes the following members.
Properties
Name | Description
Count
Returns the number of views in the enumerator.
Current
Returns the current view.
CurrentViewId
 Gets the current view identifier.
Top
Methods
Name | Description
MoveNext
Moves to the next view in the enumerator.
Reset
Resets the enumerator.
Top
See Also
Reference
Tekla.Structures.Model.UI Namespace